[
  {
    "title": "Empathie",
    "description": "Nur durch das Verständnis unserer eigenen und der Werte, Perspektiven und Gefühle unseres Gegenübers können wir effizient mit ihnen kommunizieren und zusammenarbeiten. Empathie treibt uns an, aktiv zuzuhören, einander zu unterstützen und Herausforderungen mit Mitgefühl zu begegnen – sei es mit Teammitgliedern, Kunden oder Partnern."
  },
  {
    "title": "Transparenz",
    "description": "Offene Kommunikation schafft Vertrauen. Wir pflegen transparente Prozesse und Entscheidungen und stellen sicher, dass alle die Informationen haben, die sie benötigen. Direkte Kommunikation hilft uns, Konflikte schnell zu lösen und Missverständnisse zu vermeiden."
  },
  {
    "title": "Eigenverantwortung",
    "description": "Eigenverantwortung bedeutet, die volle Verantwortung für unsere Arbeit und ihre Auswirkungen zu übernehmen. Wir befähigen jedes Teammitglied, in seiner Rolle als Leader zu agieren und mit Verantwortungsbewusstsein und Stolz Ergebnisse zu erzielen. Eigenverantwortung bedeutet, die Initiative zu ergreifen, proaktiv zu handeln, aus Fehlern zu lernen und sich kontinuierlich zu verbessern."
  },
  {
    "title": "Leidenschaft",
    "description": "Unsere Begeisterung für die Art und Weise, wie wir arbeiten, und für die Menschen und Technologien, mit denen wir zusammenarbeiten, treibt Innovation und Kreativität an. Ob beim Austausch mit unserer Community, beim Erkunden neuer Technologien, beim Eintreten für FOSS oder beim Nachgehen unserer angeborenen Neugier – unsere Leidenschaft hält uns inspiriert und motiviert. Wir feiern Nerdtum und die Freude am lebenslangen Lernen."
  },
  {
    "title": "Einfachheit",
    "description": "Sei es in unserer Kommunikation, in Designs, Code oder Verträgen – wir eliminieren unnötige Komplexität in allem, was wir tun. Indem wir uns auf das konzentrieren, was wirklich wichtig ist, und es in einfachen Worten kommunizieren, erleichtern wir es unserem Team, unseren Kunden und Partnern, effektiv und sinnvoll zusammenzuarbeiten."
  }
]
