{
  "mission": {
    "navitem": "Mission",
    "title": "Our Mission",
    "text":
      "At team be|spin we love software. Especially if it's simple, efficient and spot on the requirements. Awesome software is made by awesome teams. That's why all of our services are focused on close collaboration with your team. Also, we feel at home in private, hybrid and public clouds. That makes us your ideal partner for creating great cloud-native solutions.",
    "solutions": {
      "title": "Together, we create solutions which are",
      "operate": "easy to operate",
      "adaptable": "adaptable to change",
      "scalable": "scalable under load",
      "optimized": "optimized for your business"
    }
  },
  "services": {
    "navitem": "Services",
    "title": "Our Services",
    "text":
      "No matter whether you are embarking on a new endeavour, reworking an idea or transforming your existing applications, we work hands-on with your team in every iteration of your project. Here are some of the services we offer. If what you require is not on the list, let us know! We're always happy to innovate.",
    "timeline": {
      "assess": {
        "title": "Assess",
        "text":
          "Perfect match or too good to be true? We help you choose the right partners for your project."
      },
      "transform": {
        "title": "Transform",
        "text":
          "Everyone has a history. Together, we review your existing applications and get them ready for the cloud."
      },
      "design": {
        "title": "Design",
        "text":
          "A diagram says more than a thousand words. Let’s structure your business domain and identify crucial concepts."
      },
      "build": {
        "title": "Build",
        "text":
          "From napkin to code. We help you realize your ideas in lean and cloud-native software."
      },
      "run": {
        "title": "Run",
        "text":
          "Zero downtime. Together we continuously deploy your applications and run them at scale."
      },
      "rethink": {
        "title": "Rethink",
        "text":
          "Everything is simple in hindsight. Let’s embrace that fact and take your solution to the next level."
      }
    }
  },
  "technologies": {
    "navitem": "Technologies"
  },
  "team": {
    "navitem": "Team"
  },
  "contact": {
    "navitem": "Contact"
  },
  "subtitle": "Cloud Native Citizens"
}
