{
	"subtitle": "Cloud Native Citizens",
	"mission": {
		"nav_item": "Mission",
		"title": "Üsi Mission",
		"body": "Mir vo bespinian liebe Software. Bsungers, we si eifach u effiziänt isch u ihri Aforderige erfüllt. Grossartigi Software wird vo grossartige Teams entwicklet. Darum boue aui üsi Dienstleistige uf ere änge Zämearbeit mit dir u dim Team uf. Mir füehle üs deheim i private, hybride u public Clouds. Das macht üs zum ideale Partner für dis Ungernähme bim Kreiere vo erstklassige Cloud-basierte Lösige.",
		"solutions": {
			"title": "D Lösige, wo mir zäme kreiere, si",
			"operate": "eifach z betribe",
			"adaptable": "liecht z ändere",
			"scalable": "skalierbar unger Last",
			"optimized": "optimiert uf dini Gschäftzziel"
		}
	},
	"services": {
		"nav_item": "Dienstleistige",
		"title": "Üsi Dienstleistige",
		"body": "Egal, öb de öppis nöis afahsch, e existierendi Idee überarbeitisch oder dini bestehende Applikatione tranformiersch, mir begleite dis Team hands-on, i jedere Iteration vo dim Projekt. Hie si es paar vo de Dienstleistige, wo mir abiete. Wed öppis suechsch, wo nid uf der Liste isch, lahs üs la wüsse. Mir si immer offe für Innovation.",
		"timeline": {
			"assess": {
				"title": "Bewärte",
				"body": "Di perfekti Wahl oder z guet um wahr z sii? Mir hälfe dr di richtige Partner für dis Projekt z finge."
			},
			"transform": {
				"title": "Transformiere",
				"body": "Jedes Ungernähme het e Gschicht. Zäme analysiere mr dini bestehende Applikatione u mache se parat für d Cloud."
			},
			"design": {
				"title": "Designe",
				"body": "Es Diagramm seit meh aus tusig Wort. Mir strukturiere dini Gschäftsdomäne u identifiziere d Schlüsselkonzept."
			},
			"build": {
				"title": "Umsetze",
				"body": "Vo dr Serviette zum Source Code. Mir hälfe dr bi der Umsetzig vo dine Ideene als Cloud-basierti Software."
			},
			"run": {
				"title": "Betribe",
				"body": "Innovation ohni Ungerbruch. Mir hälfe dr bi dr erfolgriche Ifüehrig vo DevOps i dire Organisation."
			},
			"rethink": {
				"title": "Überdänke",
				"body": "Im Nachhinein isch alles eifach. Nütze mr di Tatsach u bringe dini Lösig uf di nächsti Stuefe!"
			}
		}
	},
	"customers": {
		"nav_item": "Chunde",
		"title": "Üsi Chunde",
		"body": "Mir schaffe mit Firme us ungerschidleche Branchene u vo ungerschidlecher Grössi, vom Start-up bis zum Grosskonzärn. Die Firme vertroue zum Bispil uf üsi Dienstleistige"
	},
	"partners": {
		"nav_item": "Partner",
		"title": "Üsi Partner",
		"body": "Mir si stolz uf starchi Partnerschafte, wes um Plattforme u Technologie geit. Die folgende Firme u Organisatione dörfe mir zum Bispil zu üsne Partner zelle"
	},
	"technologies": {
		"nav_item": "Technologie",
		"title": "Üsi Technologie",
		"platforms": {
			"body": {
				"intro": "Mir si überzügt, dass Ideene d Technologie söue bestimme u nid umgekehrt. Zäme finge mr Lösige uf Basis vo moderne Technologie wo dim Team ermögleche meh Zit mitem Erschaffe vo Mehrwärt z verbringe u weniger mitem Betrib vo Infrastruktur. Hie isch e Uswahl vo",
				"platforms": "Plattforme",
				"weAreNativeTo": "wo mir Experte druf si"
			}
		},
		"tools": {
			"body": {
				"intro": "Ou wenn mir nüt meh liebe als Code z schribe, isches nid üses Ding ds Rad nöi z erfinge. Mir wüsse, wes besser isch, es existierends Produkt izsetze u mir teile das Wüsse mit dim Team. Hie si es paar vo üsne liebste",
				"tools": "Tools"
			}
		}
	},
	"team": {
		"nav_item": "Team",
		"title": "Üses Team",
		"body": "Mir si Cloud Software Engineers vor erste Stung mit Bruefserfahrig sowohl i Grossungernähme als ou i Start-ups. Mir si stolz uf üsi Fähigkeite als kompetänti Architekt:inne, ifühlsami Coaches u erfahreni Coder:inne. Interessiert üs z träffe? De chum eifach ungeniert über Social Media uf üs zue, triff üs amne Meetup ir Nechi oder nütz ds Kontaktformular unge.",
		"mathis": {
			"catchphrase": "Keeper of Simple",
			"body": "Softwarearchitekt u Mitgründer. Spezialisert uf Microservices, Container-Technologie and Cloud-Native Engineering."
		},
		"lena": {
			"catchphrase": "Head in the Clouds",
			"body": "Software Engineer u Mitgründerin. Spezialisiert uf Cloud-Dienste, verteilti System u Web-Entwicklig mit moderne Technologie."
		},
		"paulina": {
			"catchphrase": "Cloud Whisperer",
			"body": "DevOps u Cloud Solution Architektin. Begeisteret vo Outomatisierig. Spezialisiert uf Systemintegration, CI/CD u Cloud-Native Lösige."
		},
		"john": {
			"catchphrase": "Cloud Wrangler",
			"body": "Wouche Büezer. Vou wändig u wouchegängig. Spezialischt für Sofort Lifer Prozäss, Infrastruktur aus Beschribig u Wouche Bouerei."
		},
		"denis": {
			"catchphrase": "Cloud Composer",
			"body": "Software Engineer. Spezialisiert uf verteilti System, Microservices, event-driven Architekture u Container Technologie."
		},
		"qasim": {
			"catchphrase": "☁boy 🤠",
			"body": "Software Engineer. Begeisteret vo moderne Technologie u Sprache. Immer uf dr Suechi nach em geeignetste Tool i dr Schublade."
		},
		"joel": {
			"catchphrase": "Cloud Surfer",
			"body": "DevOps Engineer. Liebts sicheri, zueverlässigi u skalierbari Services z entwickle u repetitivi Ufgabe z outomatisiere."
		},
		"sandra": {
			"catchphrase": "Modi vor Wouchestadt",
			"body": "Networling u Sales wärde grossgeschriebe. Events u Kafi organisiere dörfe jedoch zur Motivation vode bespinians nid fähle."
		},
		"rafael": {
			"catchphrase": "Cloud Summoner",
			"body": "Cloud Engineer. Fasziniert vom löse vo komplexe Infrastruktur-, Software- u Dateproblem, am beschte möglechscht simpu u stabiu."
		},
		"johannes": {
			"catchphrase": "Cloud Tinkerer",
			"body": "Software Engineer u Sprache-Nerd mit ere Lideschaft für moderni Technologie u Web-Entwicklig."
		},
		"noe": {
			"catchphrase": "Cloud Analyst",
			"body": "Software Engineer. Lideschaftleche Problemlöser, wo gern i komplexi System itocht, um se z entwirre und z vereifache."
		},
		"norbert": {
			"catchphrase": "Cloud Farmer",
			"body": "I warte nur druf, dass KI mi Job übernimmt, dermit i e Chohlfarm cha gründe. Bis denn wirdeni witerhin als DevOps Engineer mit Schwärpunkt Kubernetes u Outomatisierig bügle."
		},
		"rika": {
			"catchphrase": "Cloud uf Vier Pfote",
			"body": "Grosses Fällknäuel. Professionelle Bürohung u Maskottchen mit ere Begeisterig für Gebäudesicherheit."
		}
	},
	"blog": {
		"nav_item": "Blog"
	},
	"jobs": {
		"nav_item": "Jobs"
	},
	"contact": {
		"nav_item": "Kontakt",
		"title": "Kontaktier üs",
		"body": "Hesch e Frag? Bruchsch e Offerte? Oder möchtsch mal ufnes Kafi oder es Bier verbicho? I jedem Fall fröie mir üs über dini Kontaktufnahm u mälde üs so rasch wi möglech bi dir.",
		"form": {
			"nameplaceholder": "Name",
			"emailplaceholder": "Email",
			"subjectplaceholder": "Beträff",
			"messageplaceholder": "Nachricht",
			"sendbuttonlabel": "Abschicke"
		}
	},
	"customer_story": {
		"customer": "Chund",
		"background": "Usgangslag",
		"goal": "Projektziel",
		"contribution": "Rolle vo bespinian",
		"technologies": "Technologie"
	},
	"imprint": {
		"title": "Impressum",
		"contact": "Kontakt",
		"email": "E-Mail",
		"switzerland": "Schwiz",
		"headquarters": "Houptsitz",
		"bernOffice": "Büro in Bärn"
	}
}
