{
	"subtitle": "Cloud Native Citizens",
	"mission": {
		"nav_item": "Mission",
		"title": "Unsere Mission",
		"body": "Wir von bespinian lieben Software. Besonders, wenn sie einfach und effizient ist und deine Anforderungen erfüllt. Grossartige Software wird von grossartigen Teams entwickelt. Deswegen bauen alle unsere Dienstleistungen auf einer engen Zusammenarbeit mit dir und deinem Team auf. Wir sind zu Hause in privaten, hybriden und public Clouds. Das macht uns zum idealen Partner für dich beim Kreieren von erstklassigen Cloud-basierten Lösungen.",
		"solutions": {
			"title": "Die Lösungen, die wir zusammen kreieren, sind",
			"operate": "einfach zu betreiben",
			"adaptable": "leicht zu ändern",
			"scalable": "skalierbar unter Last",
			"optimized": "optimiert auf deine Geschäftsziele"
		}
	},
	"services": {
		"nav_item": "Dienstleistungen",
		"title": "Unsere Dienstleistungen",
		"body": "Egal, ob du ein neues Vorhaben beginnst, eine existierende Idee überarbeitest oder deine bestehenden Applikationen transformierst, wir begleiten dein Team hands-on, in jeder Iteration deines Projekts. Hier sind einige Dienstleistungen, die wir anbieten. Wenn du etwas suchst, das nicht auf der Liste ist, lass es uns wissen. Wir sind immer offen für Innovation.",
		"timeline": {
			"assess": {
				"title": "Bewerten",
				"body": "Die perfekte Wahl oder zu gut, um wahr zu sein? Wir helfen dir, die richtigen Partner für dein Projekt zu finden."
			},
			"transform": {
				"title": "Transformieren",
				"body": "Jedes Unternehmen hat eine Geschichte. Zusammen analysieren wir deine bestehenden Applikationen und machen sie bereit für die Cloud."
			},
			"design": {
				"title": "Designen",
				"body": "Ein Diagramm sagt mehr als tausend Worte. Wir strukturieren deine Geschäftsdomäne und identifizieren die Schlüsselkonzepte."
			},
			"build": {
				"title": "Umsetzen",
				"body": "Von der Papierserviette zum Source Code. Wir helfen dir bei der Umsetzung deiner Ideen als Cloud-basierte Software."
			},
			"run": {
				"title": "Betreiben",
				"body": "Innovation ohne Unterbruch. Wir helfen dir bei der erfolgreichen Einführung von DevOps in deiner Organisation."
			},
			"rethink": {
				"title": "Überdenken",
				"body": "Im Nachhinein ist alles einfach. Machen wir uns diese Tatsache zunutze und bringen wir deine Lösung auf die nächste Stufe!"
			}
		}
	},
	"customers": {
		"nav_item": "Kunden",
		"title": "Unsere Kunden",
		"body": "Wir arbeiten mit Firmen aus unterschiedlichen Branchen und von unterschiedlicher Grösse, vom Start-up bis zum Grosskonzern. Hier sind einige Firmen, die auf unsere Dienstleistungen vertrauen"
	},
	"partners": {
		"nav_item": "Partner",
		"title": "Unsere Partner",
		"body": "Wir sind stolz auf starke Partnerschaften, wenn es um Plattformen und Technologien geht. Hier sind einige Firmen und Organisationen, die wir zu unseren Partnern zählen dürfen"
	},
	"technologies": {
		"nav_item": "Technologien",
		"title": "Unsere Technologien",
		"platforms": {
			"body": {
				"intro": "Wir sind überzeugt, dass Ideen die Technologien bestimmen sollen und nicht umgekehrt. Zusammen entwickeln wir Lösungen auf der Basis moderner Technologien, die deinem Team ermöglichen mehr Zeit mit dem Erschaffen von Mehrwert zu verbringen und weniger mit dem Betrieb von Infrastruktur. Hier ist eine Auswahl von",
				"platforms": "Plattformen,",
				"weAreNativeTo": "auf denen wir Expert:innen sind"
			}
		},
		"tools": {
			"body": {
				"intro": "Auch wenn wir nichts mehr lieben als Code zu schreiben, ist es nicht unser Ding das Rad neu zu erfinden. Wir wissen, wann es besser ist, ein existierendes Produkt einzusetzen und wir teilen dieses Wissen mit deinem Team. Hier sind einige unserer liebsten",
				"tools": "Tools"
			}
		}
	},
	"team": {
		"nav_item": "Team",
		"title": "Unser Team",
		"body": "Wir sind Cloud Software Engineers der ersten Stunde mit Berufserfahrung sowohl in Grossunternehmen als auch in Start-ups. Wir sind stolz auf unsere Fähigkeiten als kompetente Architekt:innen, einfühlsame Coaches und erfahrene Coder:innen. Interessiert, uns zu treffen? Dann komm einfach ungeniert über Social Media auf uns zu, triff uns an einem Meetup in deiner Nähe oder nutze das Kontaktformular unten.",
		"mathis": {
			"catchphrase": "Keeper of Simple",
			"body": "Softwarearchitekt und Mitgründer. Spezialisiert auf Microservices, Container-Technologien und Cloud-Native Engineering."
		},
		"lena": {
			"catchphrase": "Head in the Clouds",
			"body": "Software Engineer und Mitgründerin. Spezialisiert auf Cloud-Dienste, verteilte Systeme und Web-Entwicklung mit modernen Technologien."
		},
		"paulina": {
			"catchphrase": "Cloud Whisperer",
			"body": "DevOps und Cloud Solution Architektin. Begeistert von Automatisierung. Spezialisiert auf Systemintegration, CI/CD und Cloud-Native Lösungen."
		},
		"john": {
			"catchphrase": "Cloud Wrangler",
			"body": "Software Architekt. Spezialisiert auf Agile Prozesse, CI/CD Lösungen, Infrastructure as Code und Cloud-Native Entwicklung."
		},
		"denis": {
			"catchphrase": "Cloud Composer",
			"body": "Software Engineer. Spezialisiert auf verteilte Systeme, Microservices, event-basierte Architekturen und Container Technologien."
		},
		"qasim": {
			"catchphrase": "☁boy 🤠",
			"body": "Software Engineer. Begeistert von modernen Technologien und Sprachen. Immer auf der Suche nach dem geeignetsten Tool in der Schublade."
		},
		"philippe": {
			"catchphrase": "Software Wizard",
			"body": "Erfahrener Software Engineer mit einer Begeisterung für Open Source, Automation, Linux und die Cloud."
		},
		"joel": {
			"catchphrase": "Cloud Surfer",
			"body": "DevOps Engineer. Liebt es, sichere, zuverlässige und skalierbare Services zu entwickeln und repetitive Aufgaben zu automatisieren."
		},
		"matthias": {
			"catchphrase": "Cloud Ninja",
			"body": "Cloud Engineer. Bestrebt, zuverlässige Produkte herzustellen und komplexe Systeme in verständliche Konzepte aufzubrechen."
		},
		"sandra": {
			"catchphrase": "Mädchen der Wolkenstadt",
			"body": "Networling und Sales werden grossgeschrieben. Events und Kaffee organisieren dürfen jedoch zur Motivation der bespinians nicht fehlen."
		},
		"rafael": {
			"catchphrase": "Cloud Summoner",
			"body": "Cloud Engineer. Fasziniert vom Lösen komplexer Infrastruktur-, Software- und Datenproblemen, möglichst einfach und widerstandsfähig."
		},
		"rika": {
			"catchphrase": "Cloud auf Vier Pfoten",
			"body": "Grosses Fellknäuel. Professioneller Bürohund und Maskottchen mit einer Begeisterung für Gebäudesicherheit."
		},
		"noe": {
			"catchphrase": "Cloud Analyst",
			"body": "Software Engineer. Leidenschaftlicher Troubleshooter, der tief in komplexe Systeme eintaucht, um sie zu entwirren und zu verbessern."
		}
	},
	"blog": {
		"nav_item": "Blog"
	},
	"jobs": {
		"nav_item": "Jobs"
	},
	"contact": {
		"nav_item": "Kontakt",
		"title": "Kontaktiere Uns",
		"body": "Hast du eine Frage? Benötigst du eine Offerte? Oder möchtest du mal auf einen Kaffee oder ein Bier vorbeikommen? In jedem Fall freuen wir uns über deine Kontaktaufnahme und melden uns so rasch wie möglich bei dir.",
		"form": {
			"nameplaceholder": "Name",
			"emailplaceholder": "Email",
			"subjectplaceholder": "Betreff",
			"messageplaceholder": "Nachricht",
			"sendbuttonlabel": "Abschicken"
		}
	},
	"customer_story": {
		"customer": "Kunde",
		"background": "Ausgangslage",
		"goal": "Projektziel",
		"contribution": "bespinians Rolle",
		"technologies": "Technologien"
	},
	"imprint": {
		"title": "Impressum",
		"contact": "Kontakt",
		"email": "E-Mail",
		"switzerland": "Schweiz",
		"headquarters": "Hauptsitz",
		"bernOffice": "Büro in Bern"
	}
}
