{
	"subtitle": "Cloud Native Citizens",
	"mission": {
		"nav_item": "Mission",
		"title": "Our Mission",
		"body": "At bespinian, we love software. Especially if it's simple, efficient, and spot on the requirements. Awesome software is made by awesome teams. That's why all of our services are focused on close collaboration with you and your team. Also, we feel at home in private, hybrid and public clouds. That makes us your ideal partner for creating great cloud-native solutions.",
		"solutions": {
			"title": "Together, we create solutions which are",
			"operate": "easy to operate",
			"adaptable": "adaptable to change",
			"scalable": "scalable under load",
			"optimized": "optimized for your business"
		}
	},
	"services": {
		"nav_item": "Services",
		"title": "Our Services",
		"body": "No matter whether you are embarking on a new endeavor, reworking an idea or transforming your existing applications, we work hands-on with your team in every iteration of your project. Here are some of the services we offer. If what you require is not on the list, please let us know. We're always happy to innovate.",
		"timeline": {
			"assess": {
				"title": "Assess",
				"body": "Perfect match or too good to be true? We help you choose the right partners for your project."
			},
			"transform": {
				"title": "Transform",
				"body": "Everyone has a history. Together, we review your existing applications and get them ready for the cloud."
			},
			"design": {
				"title": "Design",
				"body": "A diagram says more than a thousand words. Let’s structure your business domain and identify crucial concepts."
			},
			"build": {
				"title": "Build",
				"body": "From napkin to code. We help you realize your ideas in lean and cloud-native software."
			},
			"run": {
				"title": "Run",
				"body": "Innovation without downtime. We help you introduce and master DevOps in your organization."
			},
			"rethink": {
				"title": "Rethink",
				"body": "Everything is simple in hindsight. Let’s embrace that fact and take your solution to the next level!"
			}
		}
	},
	"customers": {
		"nav_item": "Customers",
		"title": "Our Customers",
		"body": "We work with companies from various areas of the industry and of all sizes, ranging from startups to major corporations. These are some of the companies who put their trust in our services"
	},
	"partners": {
		"nav_item": "Partners",
		"title": "Our Partners",
		"body": "We proudly rely on strong partners when it comes to providing platforms and related technologies. Here are some of the companies and organizations we are lucky to have as our partners"
	},
	"technologies": {
		"nav_item": "Technologies",
		"title": "Our Technologies",
		"platforms": {
			"body": {
				"intro": "We are convinced that technology should follow ideas and not the other way around. Together, we design and implement architectures based on modern technologies, which enable your team to spend more time on delivering business value and less on infrastructure operations. Here's a selection of the",
				"platforms": "platforms",
				"weAreNativeTo": "we are native to"
			}
		},
		"tools": {
			"body": {
				"intro": "Even though we passionately write code, reinventing the wheel is not our game. We know when to use an existing product to solve a problem, and we share this knowledge with your team. Here are some of our favorite",
				"tools": "tools"
			}
		}
	},
	"team": {
		"nav_item": "Team",
		"title": "The Team",
		"body": "We are cloud-native software engineers with experience in both the corporate and the startup world. We pride ourselves in being expert architects, competent coaches and seasoned coders at the same time. Interested in meeting us? You are welcome to approach us on social media or at a meetup near you.",
		"mathis": {
			"catchphrase": "Keeper of Simple",
			"body": "Software Architect and co-founder. Specialized in microservices, container technologies and cloud-native engineering."
		},
		"lena": {
			"catchphrase": "Head in the Clouds",
			"body": "Software Engineer and co-founder. Specialized in cloud services, distributed systems and web development with modern technologies."
		},
		"paulina": {
			"catchphrase": "Cloud Whisperer",
			"body": "DevOps and Cloud Solutions Architect. Automation enthusiast specialized in system integration, CI/CD and cloud-native solutions."
		},
		"john": {
			"catchphrase": "Cloud Wrangler",
			"body": "Software Architect. Specialized in agile processes, CI/CD solutions, infrastructure as code and cloud-native development."
		},
		"denis": {
			"catchphrase": "Cloud Composer",
			"body": "Software Engineer. Specialized in distributed systems, microservices, event-driven architecture and container technologies."
		},
		"qasim": {
			"catchphrase": "☁boy 🤠",
			"body": "Software Engineer. Excited by cutting edge technologies and languages. Always on the hunt for the sharpest knife in the drawer."
		},
		"joel": {
			"catchphrase": "Cloud Surfer",
			"body": "DevOps Engineer. Loves to develop secure, reliable and scalable services while automating redundant tasks."
		},
		"sandra": {
			"catchphrase": "Cloud City Girl",
			"body": "Networking and sales are very important. However, organizing events and coffee are essential for the bespinians' motivation."
		},
		"rafael": {
			"catchphrase": "Cloud Summoner",
			"body": "Cloud Engineer. Fascinated by solving complex infrastructure, software and data problems as simply and resiliently as possible."
		},
		"johannes": {
			"catchphrase": "Cloud Tinkerer",
			"body": "Software Engineer and programming language nerd with a passion for modern technologies and web development."
		},
		"noe": {
			"catchphrase": "Cloud Analyst",
			"body": "Software Engineer. Passionate troubleshooter, diving deep into complex systems to untangle and improve them."
		},
		"norbert": {
			"catchphrase": "Cloud Farmer",
			"body": "I'm just waiting for AI to take my job so I can start a cabbage farm. Until then, I'll keep working as a DevOps Engineer with a strong focus on Kubernetes and automation."
		},
		"marc": {
			"catchphrase": "Platform wizard 🧙‍♂️",
			"body": "Kubernetes-specialist who makes complex DevSecOps challenges disappear. I conjure secure, scalable platforms while exploring AI-enhanced automation. From container orchestration to CI/CD-spells, I help teams master the art of platform engineering."
		},
		"rika": {
			"catchphrase": "Cloud on Four Paws",
			"body": "Big ball of fur. Professional office dog and mascot with a passion for physical security."
		}
	},
	"blog": {
		"nav_item": "Blog"
	},
	"jobs": {
		"nav_item": "Jobs"
	},
	"contact": {
		"nav_item": "Contact",
		"title": "Contact Us",
		"body": "Have a question? Need a quote? Wanna grab a coffee or a beer? Drop us a line, and we'll be happy to get back to you as soon as possible.",
		"form": {
			"nameplaceholder": "Name",
			"emailplaceholder": "Email",
			"subjectplaceholder": "Subject",
			"messageplaceholder": "Message",
			"sendbuttonlabel": "Send"
		}
	},
	"customer_story": {
		"customer": "Customer",
		"background": "Background",
		"goal": "Project Goal",
		"contribution": "bespinian's Role",
		"technologies": "Technologies"
	},
	"imprint": {
		"title": "Imprint",
		"contact": "Contact",
		"email": "Email",
		"switzerland": "Switzerland",
		"headquarters": "Headquarters",
		"bernOffice": "Bern Office"
	}
}
