{
	"name": "Comet",
	"title": "bespinian und Comet entwickeln den IoT-Healthmonitor BLOX",
	"customer": "Die <a href=\"https://comet.tech/\" target=\"_blank\">Comet Group</a> ist ein Schweizer Unternehmen mit Sitz in Flamatt, das weltweit mehr als 1700 Mitarbeitende beschäftigt. Sie ist ein führendes Technologieunternehmen, das Innovationen in der Röntgen- und Hochfrequenzbranche vorantreibt. Der Geschäftsbereich Comet X-ray entwickelt und produziert Röntgenmodule, die eine zerstörungsfreie Prüfung von Materialien und Industriekomponenten ermöglichen. Die geprüften Teile stammen aus der Luft- und Raumfahrt, der Automobilindustrie, der Batterieindustrie, der Halbleiterindustrie und anderen Märkten.",
	"background": "Die Röntgenmodule, die Comet bei seinen Kunden weltweit einsetzt, müssen regelmässig gewartet werden. Zu wissen, was genau in diesen Geräten vor sich geht und wie sie genutzt werden, ist entscheidend für eine effiziente Arbeit mit ihnen. Mit gezielter Datenvisualisierung und präventiven Alerts lassen sich Muster, Abweichungen und Lücken erkennen, falsche Nutzung aufdecken und Ausfälle verhindern. Aus diesem Grund wollte Comet in diesem Bereich innovativ sein und ein solches Tool namens BLOX für sich und seine Kunden entwickeln.",
	"goal": "Das Ziel von BLOX ist es, Comet und seinen Kunden das Gesamtbild zu vermitteln. Durch die transparente und übersichtliche Darstellung der Metriken und Daten jedes Geräts in einer leicht verständlichen Art und Weise, die zeigt, wie das Gerät verwendet wurde. Die Benutzer können dann mögliche Probleme des Geräts untersuchen, indem sie in verschiedene Diagramme mit einer Vielzahl von Metriken eintauchen. Sie erhalten auch Warnungen und Hinweise, wenn das System ungewöhnliche Muster und unerwartete Systemzustände feststellt. bespinian und Comet entwickeln BLOX in enger Zusammenarbeit und sind sehr zufrieden damit, dass das Tool bereits einen grossen Nutzen bringt.",
	"contribution": {
		"intro": "bespinian hatte eine Schlüsselrolle in den folgenden Themen.",
		"topics": [
			{
				"title": "Infrastruktursetup",
				"body": "bespinian richtete die Infrastruktur von BLOX ein, indem wir mehrere separate Umgebungen in AWS mit Terraform bereitstellten. Diese Infrastruktur musste belastbar, einfach zu warten und kosteneffizient sein. Durch die Wahl von hochgradigen Serverless-Technologien wie AWS Lambda, Amazon DynamoDB oder Amazon S3 für verschiedene Teile der Anwendung konnte ein Grossteil des Infrastruktursetups und der -wartung an den Cloud-Anbieter delegiert werden. Durch die Verwendung von Infrastruktur als Code können wir problemlos mehrere Umgebungen verwalten und sicherstellen, dass sie gleichwertig sind."
			},
			{
				"title": "Backend-Entwicklung",
				"body": "Das Backend von BLOX ist das Herzstück der Anwendung, in dem sich die gesamte Logik befindet. Es ist in Python geschrieben, weil diese Sprache Comet gut bekannt ist, von AWS Lambda vollumfänglich unterstützt ist und uns die Flexibilität bietet, kleine iterative Änderungen durchzuführen. Das ist wichtig, denn die Business-Logik, wie die Logs und Metriken von Geräten interpretiert werden, ist mit sehr komplex. Durch die Verwendung von sauber strukturiertem und getesteten Code ist diese Komplexität jedoch gut dokumentiert und im BLOX-Backend-Code automatisiert."
			},
			{
				"title": "Frontend-Entwicklung",
				"body": "Für das Frontend, das in den Webbrowsern der Nutzer:innen dargestellt wird, haben wir uns für Svelte und Svelte Kit entschieden. Beides sind relativ neue, aber mächtige Technologien, die es uns ermöglichen, eine sichere und leistungsfähige Browseranwendung zu erstellen, die einfach zu bedienen und leicht zugänglich ist. Für das Hosting dieser Anwendung wurde eine Kombination aus S3 und CloudFront gewählt. Auf diese Weise wird BLOX auf sehr kosteneffiziente Weise bereitgestellt und ist für Comet und seine Kunden rund um den Globus zugänglich."
			},
			{
				"title": "Monitoring und Alerting",
				"body": "Da die gesamte Infrastruktur bei einem grossen Cloud-Anbieter gehostet wird, ist es ein einfacher Ansatz, die von diesem bereitgestellten Überwachungs-, Alarmierungs- und Loggingtools zu nutzen. In diesem Fall haben wir uns für Amazon CloudWatch entschieden, das die Logs des BLOX-Backends sammelt und Alerts auslöst, wenn etwas schiefläuft. Durch die Verwendung dieser Tools können wir sicherstellen, dass die Überwachungs- und Alarmierungsinfrastruktur selbst immer verfügbar ist und einen umfassenden Funktionssatz bietet."
			}
		]
	},
	"technologies": [
		"Python / Flask",
		"Svelte / SvelteKit",
		"uPlot",
		"Terraform",
		"AWS Lambda",
		"Amazon DynamoDB",
		"Amazon S3",
		"Amazon CloudFront",
		"Amazon CloudWatch"
	],
	"quote": {
		"body": "Die Expertise von bespinian im Bereich Cloud-Native hat unsere Reise von Unterbrüchen zu Durchbrüchen bei Röntgenmodulen ermöglicht. Die sehr flexible Implementierung des BLOX-Healthmonitorings war der Schlüssel dazu, dass unsere Kunden von der reaktiven zur präventiven Maintenance übergehen konnten.",
		"stakeholder": {
			"name": "Pascal Corbat",
			"role": "Product manager software"
		}
	}
}
