{
	"name": "Comet",
	"title": "bespinian unterstützt CI Tech Sensors beim Aufbau eines zentralen Notendaten-Managements",
	"customer": "<a href=\"https://www.citechsensors.com\" target=\"_blank\">CI Tech Sensors AG</a> entwickelt und produziert Banknoten-Sensoren, welche weltweit in Bankomaten, Einzahlungsautomaten und Zählmaschinen zum Einsatz kommen. CI Tech Sensors ist ein Tochterunternehmen von <a href=\"http://www.dieboldnixdorf.com\" target=\"_blank\">Diebold-Nixdorf</a> und ein langjähriger Entwicklungspartner von <a href=\"http://www.gi-de.com\" target=\"_blank\">Giesecke+Devirent</a>. CI Tech Sensors beschäftigt rund 100 Mitarbeiter an ihrem Standort in Burgdorf in der Schweiz.",
	"background": "Zur Entwicklung von Banknoten-Sensoren sind grosse Mengen an Banknoten-Daten erforderlich. Eine zentrale Rolle spielen dabei Bilddaten, etwa zum Adaptieren von Erkennungs-Algorithmen und zum anschliessenden Validieren der von den Kunden geforderten Erkennungsraten. Neben Bilddaten werden auch verschiedene Metadaten zu Banknoten benötigt, zum Beispiel Serien- und Emissions-Nummern, Qualitäts-Bewertungen sowie technische Hintergrundinformationen zum Ort und zum Gerät, mit dem die Notendaten aufgenommen wurden.",
	"goal": "Ziel des Projektes war es, alle Banknoten-Daten in eine zentrale Verwaltung zu überführen und diese allen Prozessen und Tools von CI Tech Sensors zentral zur Verfügung zu stellen. Neue Banknoten-Daten sollten bei der Aufnahme in die Verwaltung auf Gültigkeit überprüft und anschliessend redundanzfrei abgelegt werden. Jeder Banknoten-Datensatz sollte in der Verwaltung eindeutig adressierbar sein. Zudem sollten alle Banknoten-Daten unveränderbar abgelegt werden, um eine strenge Reproduzierbarkeit aller Prozessschritte bei der Entwicklung und bei der Validierung von Banknoten-Sensoren zu garantieren.",
	"contribution": {
		"intro": "bespinian hatte eine Schlüsselrolle in den folgenden Themen.",
		"topics": [
			{
				"title": "Microservice-Architektur",
				"body": "In regelmässigen Architektur-Workshops hat bespinian zusammen mit  CI Tech Sensors eine Microservice-Architektur entworfen. Mit der schrittweisen Einführung von klar abgegrenzten und wohldefinierten Services in die Prozesslandschaft konnte das zentrale Notendaten-Management eingeführt werden, ohne das Kerngeschäft von CI Tech Sensors zu beeinträchtigen. Neben der Architekturarbeit hat bespinian auch bei der hands-on Implementation der Microservices Verantwortung übernommen."
			},
			{
				"title": "Kubernetes-Infrastruktur",
				"body": "Alle Microservices des Notendaten-Managements von CI Tech Sensors werden auf Kubernetes-Infrastruktur betrieben. Hierbei hat bespinian den Lead für die Konfiguration der Kubernetes-Umgebungen und für das automatisierte Deployment der Services übernommen. In einer Mischung aus Schulung, Code-Reviews und Pair-Engineering hat bespinian sichergestellt, dass das Team von CI Tech Sensors das nötige Kubernetes Know-how aufbauen konnte, um die Services betreiben und weiterentwickeln zu können."
			},
			{
				"title": "Monitoring und Alerting",
				"body": "Die Microservices des zentralen Notendaten-Managements nehmen naturgemäss eine kritische Rolle im Kerngeschäft von CI Tech Sensors ein. Neben der operativen Überwachung der Services spielten auch fachliche Kenngrössen eine wichtige Rolle (z. B. Anzahl defekter Noten-Daten). bespinian erarbeitete zusammen mit CI Tech Sensors ein Konzept für Monitoring und Alerting basierend auf Prometheus und Grafana und übernahm den Lead bei der Implementation der Monitoring-Infrastruktur und Dashboards. Zudem hat bespinian sichergestellt, dass das Team von CI Tech Sensors sein Know-how der eingesetzten Technologien aufbauen konnte, sodass das Monitoring und Alerting zusammen mit den Microservices wachsen konnte."
			},
			{
				"title": "Übergang zum DevOps-Ansatz",
				"body": "Der Einsatz von Kubernetes und die Entwicklung einer zentralisierten, hochverfügbaren Microservice-Architektur machten den Schritt zu einem DevOps-Ansatz im Entwicklungsteam von CI Tech Sensors unumgänglich. bespinian unterstützte CI Tech Sensors bei diesem Schritt durch Coaching und Beratung der im Prozess involvierten Teams und durch das Etablieren der nötigen Tools und Abläufe."
			}
		]
	},
	"technologies": [
		"Python / Flask",
		"PostgreSQL",
		"Redis",
		"MongoDB",
		"Kubernetes",
		"Prometheus / Grafana / Alertmanager",
		"Elasticsearch / Kibana"
	],
	"quote": {
		"body": "Mit ihrer überzeugenden Mischung aus hands-on Engineering, Coaching und Beratung ist bespinian der ideale Partner und Begleiter auf unserer Reise in die Welt von Container, Microservices und DevOps.",
		"stakeholder": {
			"name": "Lukas Burger",
			"role": "Leiter Software-Entwicklung"
		}
	}
}
