{
	"name": "MeteoSchweiz",
	"title": "MeteoSchweiz und bespinian modernisieren Fachapplikationen im Projekt RZ+",
	"customer": "Im Auftrag des Bundes setzt <a href=\"https://www.meteoschweiz.admin.ch\" target=\"_blank\">MeteoSchweiz</a> die im Bundesgesetz über die Meteorologie und Klimatologie festgelegten Aufgaben um. Die Fachspezialist:innen von MeteoSchweiz betreiben das nationale Boden- und Radarmessnetz, erfassen, verwalten und analysieren Wetter- und Klimadaten. Sie erstellen Prognosen, informieren, warnen und beraten. Zudem engagieren sie sich in der Forschung und Entwicklung von massgeschneiderten Produkten und Dienstleistungen.",
	"background": "Als nationaler Wetterdienst hat MeteoSchweiz mehr als 300 verschiedene Fachapplikationen, Skripts und Services im Einsatz, die von verschiedenen Teams in agiler Methodik entwickelt und betrieben werden. Diese bilden eine komplexe und heterogene Landschaft aus miteinander interagierenden Softwarekomponenten und Services. Die Fachapplikationen nehmen einerseits wichtige Sicherheitsaufgaben wahr (z.B. die Berechnung von Flugwetterdaten). Andererseits verarbeiten sie grosse Mengen an Daten (z.B. Wetterdaten aus Messstationen). Die Kombination dieser verschiedenen Aufgaben haben stark erhöhte Anforderungen an die Verfügbarkeit und damit an die Ausfallsicherheit.",
	"goal": "Diese komplexe Sammlung wichtiger Daten, Fachapplikationen und Automatisierungen gilt es in unserer Zusammenarbeit in einem gemeinsamen Projekt zu modernisieren, georedundant zu machen und in auf die Cloud (v.a. <a href=\"https://aws.amazon.com/\" target=\"_blank\">AWS</a> und das Swiss National Supercomputing Centre des Bundes, <a href=\"https://www.cscs.ch/\" target=\"_blank\">CSCS</a>) zu migrieren. Dabei können gewisse Komponenten, welche schon containerisiert sind, einfach auf Serverless-Plattformen deployt werden. Andere Komponenten laufen auf traditioneller VM-basierter Infrastruktur und müssen erst grundlegend modernisiert werden, bevor sie in AWS betrieben werden können.",
	"contribution": {
		"intro": "bespinian spielte in folgenden Bereichen eine Schlüsselrolle:",
		"topics": [
			{
				"title": "Architekturworkshops mit Teams",
				"body": "Die Cloud-Native Expert:innen von bespinian führen proaktiv Architekturworkshops mit verschiedenen Fachteams durch, um mit ihnen die Zielarchitektur in AWS zu definieren. Zusammen mit den Fachteams wird eruiert, was die geeigneten Technologien in AWS sind und wie diese netzwerktechnisch verbunden und an die bestehende Netzwerkinfrastruktur angebunden werden können. So erhalten die Fachteams ein klares Ziel und einen schrittweisen Plan, um das Ziel zu erreichen. Die Konzeption und die anschliessende Umsetzung folgen den Prinzipien von DevOps und GitOps."
			},
			{
				"title": "Migration bestehender Applikationen auf AWS",
				"body": "Im Anschluss an die Architekturworkshops und die Definition der Zielarchitektur unterstützt bespinian die Teams bei der Durchführung der Migration. Wir definieren die AWS Ressourcen als Terraform Module und provisionieren sie automatisiert mit Terraform Cloud. Wir modernisieren den Applikationscode (zumeist Java und Python) und automatisieren die Integration und das Deployment über GitOps (Jenkins und GitLab). Durch diese enge Zusammenarbeit entsteht eine zeitnahe Modernisierung und gleichzeitig kann Wissen und Erfahrung in den Fachteams des Kunden aufgebaut werden. Die Applikationen sind sehr heterogen und reichen von einfachen Skripts über Webapplikationen bis Machine Learning Pipelines und IoT Plattformen. Die meisten Applikationen werden mittels Serverless-Services von AWS (Lambda, Batch, Step Functions) in einer eventbasierten Architektur und mit hochverfügbaren AWS Produkten (z.B. DynamoBD, SageMaker, CloudFront, S3, CloudWatch, Aurora etc.) implementiert."
			},
			{
				"title": "Bereitstellung von zentralen Komponenten und Prozessen",
				"body": "Im Rahmen der ersten Migrationen stellt bespinian zentrale Bausteine und Prozesse bereit, um zukünftige Migrationen zu optimieren und Best Practices zu verankern. Wiederverwendbare Terraform-Module werden entwickelt, um AWS-Ressourcen (z.B. Lambda-Funktionen und S3 Buckets) gemäss Best Practices bereitzustellen. Ferner werden verschiedene Guidelines erstellt zur Entwicklung von Software in der Cloud, beispielsweise zu den Themen Logging, Monitoring, oder Tracing. Dies soll die langfristige Wartbarkeit der migrierten Fachapplikationen gewährleisten. Ein GitOps-Workflow wurde definiert, um Fachapplikationen über Git ausrollen und betreiben zu können. Dieser Workflow wurde für erste Fachapplikationen beispielhaft implementiert und wird für alle nachfolgenden Migrationen als Standard verwendet."
			},
			{
				"title": "Containerisierung von Legacy-Applikationen",
				"body": "Gewisse Applikationen eignen sich nicht für eine direkte Migration auf AWS oder sind kostengünstiger im CSCS zu betreiben. In diesem Fall unterstützt bespinian die Fachteams des Kunden bei der Containerisierung und beim Aufsetzen von Kubernetes-Ressourcen. Wir schreiben Dockerfiles und Kubernetes Resource Definitions. Diese werden anschliessend automatisiert auf die interne OpenShift Plattform der MeteoSchweiz oder diejenige im CSCS deployt und betrieben."
			},
			{
				"title": "Netzwerksetup und -architektur",
				"body": "Die Netzwerkarchitektur der MeteoSchweiz ist hochkomplex. Die drei Hauptstandorte, die es zu verbinden gilt, sind einerseits die bestehende on-site Infrastruktur in Kloten und anderen Standorten, andererseits das CSCS in Lugano und die Rechenzentren von AWS. In AWS werden dabei vor allem die Regionen Zürich (eu-central-2) und Frankfurt (eu-central-1) verwendet. So entsteht ein hybrides Cloud-Setup, das grosse Datenmengen kosteneffizient und multidirektional verarbeiten können muss. bespinian spielt eine Schlüsselrolle bei der Konzeption und Umsetzung dieser Infrastruktur, zusammen mit unserem strategischen Partner <a href=\"https://nuvibit.com/\" target=\"_blank\">Nuvibit</a>, der die zugrundeliegende AWS Plattform und den Netzwerklayer auf Basis von <a href=\"https://nuvibit.com/de/nuvibit-terraform-collection/\" target=\"_blank\">NTC</a> konzpipiert und umsetzt."
			}
		]
	},
	"technologies": [
		"AWS",
		"Swiss National Supercomputing Centre (CSCS)",
		"Terraform",
		"Nuvibit Terraform Collection (NTC)",
		"OpenShift / Kubernetes",
		"Jenkins",
		"GitLab",
		"Java",
		"Python"
	],
	"quote": {
		"body": "Dank der Unterstützung von bespinian können wir unsere Fachapplikationen zukunftssicher modernisieren und nahtlos in eine georedundante Cloud-Infrastruktur integrieren.",
		"stakeholder": {
			"name": "Andrin Rüedi",
			"role": "Programmleiter, MeteoSchweiz"
		}
	}
}
